
/* 겨울 최저온도 코드 */
const winterLwetTpCode = {
    '0도 이하': '057001',
    '5도': '057002',
    '7도': '057003',
    '10도': '057004',
    '13도 이상': '057005'
};

/* 생육형태 코드 */
const grwhstleCode = {
    '직립형': '054001',
    '관목형': '054002',
    '덩굴성': '054003',
    '풀모양': '054004',
    '로제트형': '054005',
    '다육형': '054006'
};

/* 잎무늬 코드 */
const lefmrkCode = {
    '줄무늬': '070001',
    '점무늬': '070002',
    '잎 가장자리늬': '070003',
    '기타': '070004'
};

/* 잎색 코드 */
const lefcolrCode = {
    '녹색, 연두색': '069001',
    '금색, 노란색': '069002',
    '흰색, 크림색': '069003',
    '은색, 회색': '069004',
    '빨강, 분홍, 자주색': '069005',
    '여러색 혼합': '069006',
    '기타': '069007'
};

/* 꽃피는 계절 코드 */
const ignSeasonCode = {
    '봄': '073001',
    '여름': '073002',
    '가을': '073003',
    '겨울': '073004'
};

/* 꽃색 코드 */
const flclrCode = {
    '파랑색': '071001',
    '보라색': '071002',
    '분홍색': '071003',
    '빨강색': '071004',
    '오렌지색': '071005',
    '노랑색': '071006',
    '흰색': '071007',
    '혼합색': '071008',
    '기타': '071009'
};

/* 열매색 코드 */
const fmldecolrCode = {
    '파랑색': '081001',
    '보라색': '081002',
    '검정색': '081003',
    '빨강색': '081004',
    '오렌지색': '081005',
    '노랑색': '081006',
    '흰색': '081007',
    '혼합색': '081008',
    '기타': '081009'
};


/* 광도요구 코드 */
const lighttdemanddoCode = {
    '낮은 광도': '055001',
    '중간 광도': '055002',
    '높은 광도': '055003'
};


const categoryCode = {
    '광도요구': lighttdemanddoCode,
    '생육형태': grwhstleCode,
    '잎색': lefcolrCode,
    '잎무늬': lefmrkCode,
    '꽃색': flclrCode,
    '열매색': fmldecolrCode,
    '꽃피는 계절': ignSeasonCode,
    '겨울 최저온도': winterLwetTpCode,
    '가격대 구분': '',
    '물주기': '',

}

const plantRequestCode = {
     '광도요구': 'lightChkVal',
     '생육형태': 'grwgstleChkVal',
     '잎색': 'lefcolrChkVal',
     '잎무늬': 'lefmrkChkVal',
     '꽃색': 'flclrChkVal',
     '열매색': 'fmldecolrChkVal',
     '꽃피는 계절': 'ignSeasonChkVal',
     '겨울 최저온도': 'winterLwetChkVal',
     '가격대': 'priceTypeSel',
     '물주기': 'waterCycleSel',
 
 }
